bazauto/esp-layout-controller/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# The app is ~1.28 MB and does not fit the default 1 MB factory partition. Without
# this, a clean checkout compiles and links, then fails the partition size check.
# It only ever worked because the local sdkconfig — which is gitignored — had it.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y

CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
# Off, matching the working local config. This file said =y, so a clean checkout
# built firmware with the FPS/CPU overlay drawn over the UI. Pinned rather than
# deleted so an upstream default change cannot switch it back on.
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_IMGFONT=y
# LVGL demos disabled — not needed for production
# CONFIG_LV_USE_DEMO_WIDGETS is not set
# CONFIG_LV_USE_DEMO_BENCHMARK is not set
# CONFIG_LV_USE_DEMO_STRESS is not set
# CONFIG_LV_USE_DEMO_MUSIC is not set

# WebSocket handshake buffer. This sizes the buffer transport_ws builds the
# HTTP Upgrade exchange in -- NOT esp_websocket_client_config_t::buffer_size,
# which is only the client's frame buffer and has no bearing on the handshake.
#
# The orchestrator re-issues its session cookie on every response (sliding
# expiry), so the /ws upgrade's 101 carries a Set-Cookie on top of the usual
# headers. At the 1024 default that overflows and every connection attempt dies
# with "transport_ws: Header size exceeded buffer size" before the socket opens.
#
# Sized for the 101 response PLUS however much of the first frame arrives in the
# same TCP read. transport_ws exits its read loop once it finds the header
# terminator, but then still fails if the buffer filled -- and the orchestrator
# pushes a whole-layout STATE_SNAPSHOT the instant the socket opens, so the two
# regularly land together. That is why the failure was intermittent: it depends
# on packet timing, not on the headers alone.
#
# The value was previously only in the generated sdkconfig, so a clean checkout
# and CI both built with 1024 and could never have connected to the orchestrator.
CONFIG_WS_BUFFER_SIZE=16384
